forTeacher.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-28 Tue 12:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>和 AI 作朋友——高中生的 AI 工具箱</title>
<meta name="author" content="臺南一中 顏永進" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../css/muse.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">和 AI 作朋友——高中生的 AI 工具箱
<br />
<span class="subtitle">雲林場高中生 AI 工作坊</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8c62af5">1. 破題（5 min）</a>
<ul>
<li><a href="#org2089219">1.1. 本日目標：重新定義「AI 能幫你做什麼」</a></li>
<li><a href="#orgf9a8107">1.2. 今天的主線：用 AI 做一份台灣史學習歷程</a></li>
<li><a href="#orgdce9966">1.3. 為什麼選這個主題？</a></li>
<li><a href="#org381b8e2">1.4. AI 使用的三個層次</a></li>
</ul>
</li>
<li><a href="#org0506dfa">2. 工具總覽</a></li>
<li><a href="#orgc13be31">3. 第一段：AI 能幫你「讀」（20 min）</a>
<ul>
<li><a href="#orgc6417ab">3.1. Step 0｜破題引子（現場口說，30 秒）</a></li>
<li><a href="#orgbee4226">3.2. Step 1｜先問 ChatGPT：展示 Lv.1 的極限（2 min）</a></li>
<li><a href="#orgfb4da6d">3.3. Step 2｜NotebookLM：餵素材、問問題（10 min）</a></li>
<li><a href="#org71d8885">3.4. 延伸示範：不同來源交叉比對</a></li>
<li><a href="#orgb91532b">3.5. 選題：想不到題目的話，從這裡挑一個</a></li>
<li><a href="#org82a14ba">3.6. 學生產出</a></li>
<li><a href="#org8a7eb0c">3.7. 關鍵觀念</a></li>
</ul>
</li>
<li><a href="#org5f21061">4. 第二段：AI 能幫你「做」（25 min）</a>
<ul>
<li><a href="#org4a46e95">4.1. Step 3｜Napkin：畫一張「為什麼是雲林」因果關係圖（3 min）</a></li>
<li><a href="#org9c9b7d1">4.2. Step 4｜Claude 免費版：組裝成小論文格式的 Word（10 min）</a></li>
<li><a href="#org502326a">4.3. 學生實作</a></li>
<li><a href="#orga3bb6e8">4.4. 關鍵觀念</a></li>
</ul>
</li>
<li><a href="#org1dd99d7">5. 第三段：AI 能幫你「學」（20 min）</a>
<ul>
<li><a href="#org2702279">5.1. Step 5｜prompt 三招就夠用：給角色、給範例、給限制</a></li>
<li><a href="#orge6061eb">5.2. Step 6｜寫作教練 Demo：用 AI 改反思，不是用 AI 寫反思</a></li>
<li><a href="#orgf52584e">5.3. 改完反思，更新進 Word</a></li>
<li><a href="#org3698168">5.4. 學生實作</a></li>
<li><a href="#orgcf1156e">5.5. 關鍵觀念</a></li>
</ul>
</li>
<li><a href="#org2b38b06">6. 第四段：做簡報（15 min）</a>
<ul>
<li><a href="#orgb32f22c">6.1. Step 7｜Gamma 或 Claude：用 Word 內容生成投影片</a></li>
<li><a href="#orgb6d6f7a">6.2. 學生實作</a></li>
<li><a href="#orgc8d055b">6.3. 關鍵觀念</a></li>
</ul>
</li>
<li><a href="#orgdba3c1d">7. 第五段：AI 能幫你「創造」（20 min）</a>
<ul>
<li><a href="#orgfd24ae9">7.1. Claude Code / Gemini CLI Demo（重頭戲）</a></li>
<li><a href="#orgd9ff481">7.2. Agent 串接壓軸：一句話跑完「分析→產出→發佈」</a></li>
<li><a href="#orgc57bb0c">7.3. 檔案整理：讓 AI 動手收你的爛攤子</a></li>
<li><a href="#org9ebd2e1">7.4. Ideogram Demo：專題封面圖</a></li>
<li><a href="#org020dfda">7.5. 學生實作</a></li>
<li><a href="#org88eac07">7.6. 關鍵觀念</a></li>
</ul>
</li>
<li><a href="#org04cc260">8. 第六段：AI 到底怎麼辦到的？（15 min）</a>
<ul>
<li><a href="#orgf4a3e69">8.1. AI 的本質是「函數」</a></li>
<li><a href="#orgc9af450">8.2. 生成式 AI 是「會接龍的函數」</a></li>
<li><a href="#org141698c">8.3. Token：AI 眼中的世界</a></li>
<li><a href="#orge8e9d6c">8.4. 訓練三階段</a></li>
<li><a href="#orgae424ec">8.5. 幻覺（Hallucination）——回到主線的警鐘</a></li>
<li><a href="#orgfd01ea9">8.6. 另一條紅線：什麼東西不該丟雲端</a></li>
</ul>
</li>
<li><a href="#org26e16c3">9. 收尾（5 min）</a>
<ul>
<li><a href="#org0051120">9.1. 你手上現在有什麼？</a></li>
<li><a href="#org903e7f7">9.2. 三個帶走的觀念</a></li>
<li><a href="#org7094b5f">9.3. 下一步：往 Lv.4 走</a></li>
</ul>
</li>
<li><a href="#org538845f">10. 附錄：工具準備清單</a></li>
<li><a href="#org392557d">11. 附錄：NotebookLM 素材——請把以下連結存成 PDF 後上傳</a>
<ul>
<li><a href="#org66f90c0">11.1. 主要素材（建議三份都上傳）</a></li>
<li><a href="#org0f10858">11.2. 補充素材（進階探索用）</a></li>
</ul>
</li>
<li><a href="#org1e09faf">12. 附錄：小論文格式規範（貼給 Claude 用）</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8c62af5" class="outline-2">
<h2 id="org8c62af5"><span class="section-number-2">1.</span> 破題（5 min）</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>「AI 不是未來的事，是現在的事。問題不是要不要用，而是你會不會用。」</li>
<li>「還在 prompt-copy-paste？今天帶你看真正的玩法。」</li>
</ul>
</div>
<div id="outline-container-org2089219" class="outline-3">
<h3 id="org2089219"><span class="section-number-3">1.1.</span> 本日目標：重新定義「AI 能幫你做什麼」</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>把 AI 當「同事」，不是當「字典」</li>
<li>字典：你問一個字、它給你一個解釋（Lv.1）</li>
<li>同事：你說「下週要交報告」，它幫你規劃、產出、修改（Lv.3）</li>
<li>今天的目標：學會怎麼「交辦」</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9a8107" class="outline-3">
<h3 id="orgf9a8107"><span class="section-number-3">1.2.</span> 今天的主線：用 AI 做一份台灣史學習歷程</h3>
<div class="outline-text-3" id="text-1-2">
<p>
整場工作坊圍繞一個主題貫穿到底：*為什麼日本人選雲林蓋糖廠？*
</p>

<p>
結束時，每個人帶走一份 <b>真的可以上傳</b> 的學習歷程成品：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">階段</th>
<th scope="col" class="org-left">你做了什麼</th>
<th scope="col" class="org-left">帶走的東西</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">讀</td>
<td class="org-left">用 NotebookLM 消化糖業史料</td>
<td class="org-left">選題方向 + 核心觀念筆記</td>
</tr>

<tr>
<td class="org-left">做</td>
<td class="org-left">用 Napkin 生圖 + Claude 生 Word</td>
<td class="org-left">一份小論文格式的 .docx 初稿</td>
</tr>

<tr>
<td class="org-left">學</td>
<td class="org-left">用 ChatGPT 當教練改反思</td>
<td class="org-left">一段有深度的反思文字，更新進 Word</td>
</tr>

<tr>
<td class="org-left">簡報</td>
<td class="org-left">用 Gamma 或 Claude 做投影片</td>
<td class="org-left">一份課程學習成果簡報</td>
</tr>

<tr>
<td class="org-left">創造</td>
<td class="org-left">用 AI Agent 做互動網頁（加分）</td>
<td class="org-left">一個可展示的糖業史時間軸網站</td>
</tr>
</tbody>
</table>

<p>
每一段的產出直接疊進下一段。
</p>
</div>
</div>
<div id="outline-container-orgdce9966" class="outline-3">
<h3 id="orgdce9966"><span class="section-number-3">1.3.</span> 為什麼選這個主題？</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>你現在人在雲林——虎尾糖廠就在隔壁，有人去過嗎？</li>
<li>108課綱歷史第一冊第五章「拚經濟與求生存的人們」，日治時期的產業發展就在考試範圍裡</li>
<li>在地題材寫進學習歷程，跟別人的撞題率低，審查委員會記得你</li>
</ul>
</div>
</div>
<div id="outline-container-org381b8e2" class="outline-3">
<h3 id="org381b8e2"><span class="section-number-3">1.4.</span> AI 使用的三個層次</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">階段</th>
<th scope="col" class="org-left">做法</th>
<th scope="col" class="org-left">代表工具</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Lv.1 問答機</td>
<td class="org-left">prompt → copy → paste</td>
<td class="org-left">ChatGPT 網頁版</td>
</tr>

<tr>
<td class="org-left">Lv.2 整合工作流</td>
<td class="org-left">AI 直接嵌在你的工具裡</td>
<td class="org-left">Copilot、NotebookLM</td>
</tr>

<tr>
<td class="org-left">Lv.3 AI Agent</td>
<td class="org-left">AI 自己規劃步驟、操作電腦完成任務</td>
<td class="org-left">Claude Code、Gemini CLI</td>
</tr>

<tr>
<td class="org-left">Lv.4 專屬助理</td>
<td class="org-left">你訓練它記得你的偏好，愈用愈順手</td>
<td class="org-left">Skills / MCP（2026 起飛）</td>
</tr>
</tbody>
</table>

<p>
大部分人卡在 Lv.1，所以寫出來的東西又累又像罐頭。今天直接跳到 Lv.3，並在收尾「點到」Lv.4——讓你知道，AI 還會繼續長，現在學的是「怎麼跟它一起長」。
</p>
</div>
</div>
</div>
<div id="outline-container-org0506dfa" class="outline-2">
<h2 id="org0506dfa"><span class="section-number-2">2.</span> 工具總覽</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">順序</th>
<th scope="col" class="org-left">工具</th>
<th scope="col" class="org-left">今天怎麼用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">NotebookLM</td>
<td class="org-left">餵素材、問問題、產出研究筆記</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Napkin</td>
<td class="org-left">畫因果關係圖 / 流程圖</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Claude（網頁版）</td>
<td class="org-left">組裝成小論文格式的 Word 檔</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">ChatGPT</td>
<td class="org-left">當教練改反思，改完更新進 Word</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Gamma 或 Claude</td>
<td class="org-left">用 Word 內容生成報告簡報</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Claude Code（加分）</td>
<td class="org-left">做一個糖業史互動時間軸網站</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc13be31" class="outline-2">
<h2 id="orgc13be31"><span class="section-number-2">3.</span> 第一段：AI 能幫你「讀」（20 min）</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>場景：你想寫一份台灣史的課程學習成果，但三份史料根本還沒消化</b>
</p>
</div>
<div id="outline-container-orgc6417ab" class="outline-3">
<h3 id="orgc6417ab"><span class="section-number-3">3.1.</span> Step 0｜破題引子（現場口說，30 秒）</h3>
<div class="outline-text-3" id="text-3-1">
<p>
「虎尾糖廠 1906 年蓋的，是當時東洋最大的糖廠。但你有沒有想過——全台灣這麼多地方，日本人為什麼偏偏選雲林？不是台南、不是高雄、不是屏東，是雲林。為什麼？」
</p>
</div>
</div>
<div id="outline-container-orgbee4226" class="outline-3">
<h3 id="orgbee4226"><span class="section-number-3">3.2.</span> Step 1｜先問 ChatGPT：展示 Lv.1 的極限（2 min）</h3>
<div class="outline-text-3" id="text-3-2">
<p>
現場打開 ChatGPT，直接問：
</p>

<blockquote>
<p>
日本人為什麼選擇在雲林虎尾蓋糖廠？
</p>
</blockquote>

<p>
ChatGPT 會給一個看起來不錯的回答（氣候、土地之類的），但：
</p>
<ul class="org-ul">
<li>可能混入不正確的細節（幻覺）</li>
<li>不會提到「戊戌大水災」這個關鍵事件</li>
<li>沒有引用來源，你不知道哪句話是真的</li>
</ul>

<p>
「這就是 Lv.1——你問一個問題，它給你一個答案，但你沒辦法驗證。接下來我們用 Lv.2 的方式。」
</p>
</div>
</div>
<div id="outline-container-orgfb4da6d" class="outline-3">
<h3 id="orgfb4da6d"><span class="section-number-3">3.3.</span> Step 2｜NotebookLM：餵素材、問問題（10 min）</h3>
<div class="outline-text-3" id="text-3-3">
<p>
事前已上傳的素材：
</p>
<ol class="org-ol">
<li><a href="https://zh.wikipedia.org/zh-tw/%E8%87%BA%E7%81%A3%E7%B3%96%E6%A5%AD%E5%8F%B2">臺灣糖業史——維基百科</a></li>
<li><a href="https://vocus.cc/article/6667e00efd89780001a6eb91">臺灣「糖都」之父——虎尾糖廠</a></li>
<li><a href="https://www.twcenter.org.tw/wp-content/uploads/2015/05/g02_07_02_05.pdf">近代產業——雲林糖業的興衰（楊彥騏）</a></li>
<li><a href="https://www.taisugar.com.tw/chinese/Attractions_detail.aspx?n=10048&amp;s=69&amp;p=0">虎尾糖廠製糖工場——台糖官網</a></li>
</ol>

<p>
更多素材見附錄「NotebookLM 素材」，共 13 份，學生可自行加入感興趣的文獻。
</p>

<p>
現場依序問四個問題：
</p>

<blockquote>
<p>
第一問（大方向）：根據這些資料，日本人為什麼選擇在雲林虎尾設立糖廠？有哪些關鍵因素？
</p>
</blockquote>

<blockquote>
<p>
第二問（追細節）：戊戌大水災跟糖廠設立的關係是什麼？請引用原文說明。
</p>
</blockquote>

<blockquote>
<p>
第三問（比較）：同一時期台灣其他地方也有糖廠，虎尾糖廠跟橋頭糖廠比起來，設廠條件有什麼不同？
</p>
</blockquote>

<blockquote>
<p>
第四問（學習歷程切入）：如果我要寫一篇小論文，題目是「為什麼是雲林？——日本人在虎尾蓋糖廠的五個原因」，你建議我的大綱怎麼寫？
</p>
</blockquote>

<p>
問完之後，不要一個一個複製——請 NotebookLM 自己打包：
</p>

<blockquote>
<p>
請把我們剛才所有對話的內容整合成一份「研究筆記」，格式如下：
</p>

<p>
一、研究問題：為什麼日本人選擇在雲林虎尾蓋糖廠？
二、關鍵發現：列出所有重要事實，每一點後面標明出處（來源文件名稱），例如：「1897 年戊戌大水災沖出大量溪埔地（出處：楊彥騏，〈近代產業——雲林糖業的興衰〉）」
三、比較分析：虎尾 vs. 其他糖廠的差異
四、建議大綱：小論文的章節架構
五、參考資料清單：列出所有引用過的文件名稱與作者
</p>
</blockquote>

<p>
→ NotebookLM 會把前面所有零碎的問答，整合成一份完整的研究筆記
→ <b>只要複製這一份</b> ，就是等一下餵給 Claude 生成 Word 的全部素材
</p>
</div>
</div>
<div id="outline-container-org71d8885" class="outline-3">
<h3 id="org71d8885"><span class="section-number-3">3.4.</span> 延伸示範：不同來源交叉比對</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>四份資料的觀點不一樣：維基偏結構、vocus 偏故事、楊彥騏偏在地、台糖偏官方</li>
<li>問 NotebookLM：「這幾份資料對虎尾糖廠設廠原因的描述有什麼差異？」</li>
<li>展示 AI 整合多來源的能力——這才是 Lv.2 的用法，不是單純問一個問題</li>
</ul>
</div>
</div>
