forTeacher.html
<div id="outline-container-orgb91532b" class="outline-3">
<h3 id="orgb91532b"><span class="section-number-3">3.5.</span> 選題：想不到題目的話，從這裡挑一個</h3>
<div class="outline-text-3" id="text-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">編號</th>
<th scope="col" class="org-left">題目</th>
<th scope="col" class="org-left">建議素材</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">虎尾糖廠的冰為什麼特別好吃？——從一支冰棒認識糖廠還在做什麼</td>
<td class="org-left">13, 3, 10</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">阿公阿嬤口中的「糖廠」是什麼樣子？——家族記憶裡的糖廠生活</td>
<td class="org-left">4, 6, 10</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">那條鐵軌為什麼還在？——五分車從載甘蔗到載觀光客的故事</td>
<td class="org-left">12, 2, 6</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">為什麼虎尾以前叫「糖都」？——一個小鎮怎麼變成全台最重要的糖廠</td>
<td class="org-left">2, 4</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">日本人為什麼來雲林種甘蔗？——你家附近的田，一百年前可能是甘蔗園</td>
<td class="org-left">4, 1, 11</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">糖廠旁邊那些舊房子該拆掉嗎？——老建築保存 vs. 蓋新東西的兩難</td>
<td class="org-left">12, 11</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">一顆方糖的旅程——從田裡的甘蔗到你桌上的糖，中間經過什麼？</td>
<td class="org-left">4, 5, 13</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">糖廠關了，然後呢？——虎尾糖廠現在變成什麼樣子</td>
<td class="org-left">13, 12, 10</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>建議素材欄的編號對應本文件附錄的素材清單</li>
<li>也歡迎自己想題目！只要跟雲林糖業有關，都可以用 NotebookLM 裡的素材來研究</li>
</ul>
</div>
</div>
<div id="outline-container-org82a14ba" class="outline-3">
<h3 id="org82a14ba"><span class="section-number-3">3.6.</span> 學生產出</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>一份「選題方向 + 核心觀念清單」</li>
<li>例如：選了第 4 題「為什麼虎尾以前叫糖都？」→ 核心觀念包括：大日本製糖設廠、日搾量東洋第一、鈴木藤三郎</li>
</ul>
</div>
</div>
<div id="outline-container-org8a7eb0c" class="outline-3">
<h3 id="org8a7eb0c"><span class="section-number-3">3.7.</span> 關鍵觀念</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>AI 幫你消化資訊，但理解還是要靠你自己</li>
<li>重點不是 AI 給你什麼答案，而是你會不會問出好問題</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5f21061" class="outline-2">
<h2 id="org5f21061"><span class="section-number-2">4.</span> 第二段：AI 能幫你「做」（25 min）</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>場景：選題方向定了，要把 NotebookLM 的筆記變成一份可以交的小論文</b>
</p>
</div>
<div id="outline-container-org4a46e95" class="outline-3">
<h3 id="org4a46e95"><span class="section-number-3">4.1.</span> Step 3｜Napkin：畫一張「為什麼是雲林」因果關係圖（3 min）</h3>
<div class="outline-text-3" id="text-4-1">
<p>
把以下文字貼進 Napkin：
</p>

<blockquote>
<p>
日本選擇在雲林虎尾設立糖廠的原因：
</p>
<ol class="org-ol">
<li>天災創造機會：1897 戊戌大水災沖出大量溪埔地，成為無主地，容易取得</li>
<li>自然條件適合：雲林平原日照充足、雨量適中，甘蔗生長條件好</li>
<li>政策推動：1902 年台灣總督府頒布糖業獎勵規則，提供設廠補助</li>
<li>企業家眼光：鈴木藤三郎（製糖王）看中虎尾的潛力，1906 年設廠</li>
<li>國家需求：日俄戰爭後，日本需要糖的自給自足，台灣是最近的產地</li>
</ol>
</blockquote>

<p>
→ Napkin 自動產出一張因果關係圖
→ 這張圖之後放進小論文的「概念整理」段落
</p>
</div>
</div>
<div id="outline-container-org9c9b7d1" class="outline-3">
<h3 id="org9c9b7d1"><span class="section-number-3">4.2.</span> Step 4｜Claude 免費版：組裝成小論文格式的 Word（10 min）</h3>
<div class="outline-text-3" id="text-4-2">
<p>
操作流程（現場示範）：
</p>
<ol class="org-ol">
<li>打開 <a href="https://claude.ai">claude.ai</a>（免費帳號即可）</li>
<li>先貼上小論文格式規範（見本文件附錄，或直接上傳格式說明 PDF）</li>
<li>再貼上 Step 2 NotebookLM 產出的「含出處的摘要」（有標明每個重點來自哪份文件）</li>
<li>下指令（現場直接複製貼上）：</li>
</ol>

<blockquote>
<p>
請根據上面的「全國高級中等學校小論文寫作比賽格式說明」，把我提供的素材整理成一份符合格式的小論文，輸出為 Word 檔（.docx）。
</p>

<p>
基本資訊：
</p>
<ul class="org-ul">
<li>投稿類別：史地類</li>
<li>篇名：為什麼是雲林？——日本人在虎尾蓋糖廠的五個原因</li>
<li>作者：（我會自己填）</li>
<li>指導老師：（我會自己填）</li>
</ul>

<p>
大綱：
</p>
<ul class="org-ul">
<li>壹、前言：我住在雲林，虎尾糖廠就在附近，一直好奇為什麼日本人選這裡蓋全台最大的糖廠</li>
<li>貳、正文：分析五個設廠因素（天災與土地、氣候條件、政策獎勵、企業家決策、日本國家戰略），每個因素引用素材中的具體事實</li>
<li>參、結論：雲林成為糖都不是偶然，是天災、政策、資本三者交會的結果</li>
<li>肆、引註資料：至少列出 3 篇，不得全部來自網站</li>
</ul>

<p>
請嚴格遵守以下格式：
</p>
<ul class="org-ul">
<li>新細明體 12 級字，單行間距，邊界上下左右各留 2 公分</li>
<li>封面頁單獨一頁、不編頁碼</li>
<li>正文分層次：一、→（一）→ 1、→（1）</li>
<li>每頁頁首加入篇名（10級字、置中），頁尾插入頁碼（10級字、置中）</li>
<li>引用原文以粗體加「」標明，並標註（作者，年代）</li>
<li>引註資料至少 3 篇，不得全部來自網站</li>
<li>總篇幅 4-10 頁（不含封面）</li>
<li>請根據素材中標示的出處，自動生成「肆、引註資料」段落，引註格式依照中學生網站小論文比賽規範</li>
</ul>
</blockquote>

<ol class="org-ol">
<li>Claude 生成 Artifact → 點「下載」→ 拿到 .docx 檔</li>
<li>用 Word 或 Google Docs 開啟，快速瀏覽——這是初稿，反思段落還沒寫好</li>
</ol>

<p>
也可以用 Gemini（備案）：匯出到 Google Docs → 檔案 → 下載 → Microsoft Word (.docx)
</p>
</div>
</div>
<div id="outline-container-org502326a" class="outline-3">
<h3 id="org502326a"><span class="section-number-3">4.3.</span> 學生實作</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>用 Claude 或 Gemini，把你在第一段整理出的筆記組裝成一份小論文 Word 檔</li>
<li>下載後打開，先檢查事實：人名、年份、事件有沒有被 AI 改掉或編出來</li>
</ul>
</div>
</div>
<div id="outline-container-orga3bb6e8" class="outline-3">
<h3 id="orga3bb6e8"><span class="section-number-3">4.4.</span> 關鍵觀念</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>AI 幫你產出初稿，但「你的判斷」才是學習歷程的靈魂</li>
<li>這份 Word 還不能直接交——反思段落還是 AI 罐頭，下一段來改</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1dd99d7" class="outline-2">
<h2 id="org1dd99d7"><span class="section-number-2">5.</span> 第三段：AI 能幫你「學」（20 min）</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>場景：Word 初稿有了，但反思段落像流水帳，一看就知道是 AI 寫的</b>
</p>
</div>
<div id="outline-container-org2702279" class="outline-3">
<h3 id="org2702279"><span class="section-number-3">5.1.</span> Step 5｜prompt 三招就夠用：給角色、給範例、給限制</h3>
<div class="outline-text-3" id="text-5-1">
<p>
現場對照 Demo（同一題用兩種方式問，看差距）：
</p>

<p>
爛 prompt：
</p>
<blockquote>
<p>
幫我寫一段關於日治糖業的學習歷程反思
</p>
</blockquote>
<p>
→ 罐頭、流水帳
</p>

<p>
好 prompt：
</p>
<blockquote>
<p>
我住雲林，常經過虎尾糖廠，以前只覺得是一個老地方。這次研究之後才知道，原來日本人選雲林蓋糖廠不是巧合，是因為一場水災沖出了大片空地。幫我用這個「從不在意到覺得驚訝」的轉變，寫一段反思初稿。風格要像高中生自己寫的，不要太文言，300字以內。
</p>
</blockquote>
<p>
→ 有你的影子
</p>

<p>
結論：你給 AI 多少「你的樣子」，它就回給你多少「你的樣子」
</p>
</div>
</div>
<div id="outline-container-orge6061eb" class="outline-3">
<h3 id="orge6061eb"><span class="section-number-3">5.2.</span> Step 6｜寫作教練 Demo：用 AI 改反思，不是用 AI 寫反思</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>學習歷程最難的不是報告本體，是「反思」</li>
<li>把 Step 5 AI 生成的初稿當作起點，接著用 AI 當教練：</li>
</ul>

<blockquote>
<p>
這段反思只在描述我對糖廠的感覺，沒有連結到「為什麼是雲林」這個研究問題，幫我指出哪裡可以改。
</p>
</blockquote>

<blockquote>
<p>
給我三種不同角度切入反思：我學到了什麼能力 / 我對家鄉的看法改變了什麼 / 這個研究讓我想繼續探索什麼
</p>
</blockquote>

<blockquote>
<p>
這句話怎麼改更有力？
</p>
</blockquote>

<ul class="org-ul">
<li>*關鍵訊息*：AI 是逼你想清楚的教練，不是幫你寫的槍手</li>
</ul>
</div>
</div>
<div id="outline-container-orgf52584e" class="outline-3">
<h3 id="orgf52584e"><span class="section-number-3">5.3.</span> 改完反思，更新進 Word</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>把改好的反思文字貼回 Step 4 下載的 Word 檔，取代 AI 原本生的罐頭反思</li>
<li>這份 Word 現在可以上傳了</li>
</ul>
</div>
</div>
<div id="outline-container-org3698168" class="outline-3">
<h3 id="org3698168"><span class="section-number-3">5.4.</span> 學生實作</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>用 AI 當教練，改你 Word 檔裡的反思段落</li>
<li>至少跟 AI 來回三輪：寫初稿 → 請 AI 指出問題 → 你自己改 → 再請 AI 看</li>
<li>改好後貼回 Word 檔</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf1156e" class="outline-3">
<h3 id="orgcf1156e"><span class="section-number-3">5.5.</span> 關鍵觀念</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>用 AI 當教練，不是當槍手</li>
<li>學習歷程最看重的是「你的思考」，AI 幫你把思考變清晰，不是幫你生思考</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2b38b06" class="outline-2">
<h2 id="org2b38b06"><span class="section-number-2">6.</span> 第四段：做簡報（15 min）</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>場景：Word 完成了，但老師要你上台報告，需要一份簡報</b>
</p>
</div>
<div id="outline-container-orgb32f22c" class="outline-3">
<h3 id="orgb32f22c"><span class="section-number-3">6.1.</span> Step 7｜Gamma 或 Claude：用 Word 內容生成投影片</h3>
<div class="outline-text-3" id="text-6-1">
<p>
把 Word 檔的文字內容（或 Step 2 的摘要 + 改好的反思）貼進 Gamma，輸入：
</p>

<blockquote>
<p>
高中歷史課程學習成果報告簡報。
標題：為什麼是雲林？——日本人在虎尾蓋糖廠的五個原因。
內容包含：
一、研究動機（我住雲林，糖廠就在旁邊，想知道為什麼是這裡）
二、日本設廠的五個關鍵因素（天災、氣候、政策、企業家、國家需求）
三、學習反思
</p>
</blockquote>

<p>
→ Gamma 30 秒生成簡報
→ 現場快速改一兩張：刪掉 AI 亂加的內容、補上自己的話
</p>

<p>
也可以用 Claude 免費版直接生成 .pptx 檔下載。
</p>
</div>
</div>
<div id="outline-container-orgb6d6f7a" class="outline-3">
<h3 id="orgb6d6f7a"><span class="section-number-3">6.2.</span> 學生實作</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>用 Gamma 或 Claude 把你的 Word 內容做成一份簡報</li>
<li>完成後跟旁邊同學互看：「你覺得這份簡報哪裡看得出是你做的、哪裡像 AI 罐頭？」</li>
</ul>
</div>
</div>
<div id="outline-container-orgc8d055b" class="outline-3">
<h3 id="orgc8d055b"><span class="section-number-3">6.3.</span> 關鍵觀念</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>簡報是用來「說」的，不是用來「讀」的——每張投影片只留關鍵字，細節用嘴巴講</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdba3c1d" class="outline-2">
<h2 id="orgdba3c1d"><span class="section-number-2">7.</span> 第五段：AI 能幫你「創造」（20 min）</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>場景：想讓你的學習歷程跟隔壁不一樣——不只是 Word 檔</b>
</p>
</div>
<div id="outline-container-orgfd24ae9" class="outline-3">
<h3 id="orgfd24ae9"><span class="section-number-3">7.1.</span> Claude Code / Gemini CLI Demo（重頭戲）</h3>
<div class="outline-text-3" id="text-7-1">
<p>
現場演示，一句話下指令：
</p>
<ul class="org-ul">
<li>「把這份雲林糖業報告做成一個互動時間軸網站：1906 大日本製糖設廠 → 1924 日搾量東洋第一 → 1945 戰後台糖接收 → 2000s 轉型文創園區」</li>
<li>AI 自己建檔案 → 寫 HTML/CSS/JS → 跑起來</li>
<li>再追加需求：「加一個小測驗：三題關於虎尾糖廠的選擇題」→ AI 自己改 code</li>
<li>這一份互動網頁連結放進學習歷程，審查委員會記得你</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9ff481" class="outline-3">
<h3 id="orgd9ff481"><span class="section-number-3">7.2.</span> Agent 串接壓軸：一句話跑完「分析→產出→發佈」</h3>
<div class="outline-text-3" id="text-7-2">
<p>
現場示範，用虎尾糖廠當素材：
</p>
<ol class="org-ol">
<li>AI 分析糖廠的歷史脈絡、關鍵轉折點、重要人物（鈴木藤三郎、藤山雷太）</li>
<li>產出一頁互動心得網頁（可放進學習歷程的「自主學習」）</li>
<li>草擬一則 IG 貼文：「你知道雲林曾是全台灣最甜的地方嗎？#虎尾糖廠 #台灣史 #學習歷程」</li>
<li>同時生成一張封面視覺（接 Ideogram：日治糖廠意象）</li>
</ol>

<p>
一條指令，從「讀」到「寫」到「視覺」全包。
</p>
<ul class="org-ul">
<li>重點不是「你要會 Agent」，而是「同樣兩小時，你能交出的東西多了三倍」</li>
<li>紅線提醒：最後一關永遠是你——AI 交成品，掛名的是你</li>
</ul>
</div>
</div>
<div id="outline-container-orgc57bb0c" class="outline-3">
<h3 id="orgc57bb0c"><span class="section-number-3">7.3.</span> 檔案整理：讓 AI 動手收你的爛攤子</h3>
<div class="outline-text-3" id="text-7-3">
<p>
最容易立刻有感的場景：
</p>
<ul class="org-ul">
<li>「下載」資料夾爆滿，AI 幫你按類型／日期分類</li>
<li>手機照片亂成一片，AI 按事件改名（例：~20260315_期中考週_讀書會.jpg~）</li>
<li>學期末把所有作業檔案按科目歸檔、改成可讀的檔名</li>
<li>為什麼學生該會：你的學習歷程素材，平常就該被整理好；不是上傳前一晚才在翻</li>
</ul>
</div>
</div>
<div id="outline-container-org9ebd2e1" class="outline-3">
<h3 id="org9ebd2e1"><span class="section-number-3">7.4.</span> Ideogram Demo：專題封面圖</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>用文字描述生成封面視覺：「日治時期台灣糖廠，五分車鐵道，甘蔗田，復古海報風格」</li>
<li>做一張放在學習歷程報告首頁的封面圖</li>
<li>Ideogram 特別擅長有文字標語的海報</li>
</ul>
</div>
</div>
