forTeacher.html
<div id="outline-container-org020dfda" class="outline-3">
<h3 id="org020dfda"><span class="section-number-3">7.5.</span> 學生實作</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>把你前三段做出來的糖業史報告，選一個段落做成互動網頁</li>
<li>或用 Ideogram 做一張你這份學習歷程的封面圖</li>
</ul>
</div>
</div>
<div id="outline-container-org88eac07" class="outline-3">
<h3 id="org88eac07"><span class="section-number-3">7.6.</span> 關鍵觀念</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>從 prompt-copy-paste 進化到 AI Agent——AI 自己規劃、自己執行</li>
<li>你的學習歷程不只是文字檔，可以是互動網頁、時間軸、資訊圖表</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org04cc260" class="outline-2">
<h2 id="org04cc260"><span class="section-number-2">8.</span> 第六段：AI 到底怎麼辦到的？（15 min）</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgf4a3e69" class="outline-3">
<h3 id="orgf4a3e69"><span class="section-number-3">8.1.</span> AI 的本質是「函數」</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>「你國中學過函數對不對？輸入一個值、經過規則、得到輸出。AI 做的事情一模一樣。」</li>
<li>現場舉例：
<ul class="org-ul">
<li>手寫辨識：輸入圖片 → f → 輸出「這是 5」（機率 92%）</li>
<li>貓狗辨識：輸入照片 → f → 輸出「貓 90%、狗 10%」</li>
<li>文字生成：輸入提示詞 → f → 輸出生成的文字</li>
</ul></li>
<li>「不管 AI 看起來多厲害，骨子裡都是：輸入 → 函數 → 輸出」</li>
<li>差別在於函數裡有幾千億個參數，從海量資料中「學」出來的</li>
<li>教材參考：南大生成式AI教材【腳本】04. 函數：AI 的本質</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9af450" class="outline-3">
<h3 id="orgc9af450"><span class="section-number-3">8.2.</span> 生成式 AI 是「會接龍的函數」</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>「那生成式 AI 是什麼樣的函數？答案：一個每次只猜下一個字的函數。」</li>
<li>現場示範接龍過程（用 ChatGPT 的 streaming 效果）：
<ul class="org-ul">
<li>f(&ldquo;什麼是臺灣最美的風景？&rdquo;) → 臺</li>
<li>f(&ldquo;什麼是臺灣最美的風景？臺&rdquo;) → 灣</li>
<li>……依此類推</li>
</ul></li>
<li>「就像 LINE 鍵盤自動建議下一個字——AI 做一樣的事，只是猜得非常準」</li>
<li>溫度參數（Temperature）：加入隨機性，同一題可能不同答案
<ul class="org-ul">
<li>溫度低 → 回答比較固定</li>
<li>溫度高 → 回答比較有創意，但也比較容易出錯</li>
</ul></li>
<li>「這也解釋了為什麼會有幻覺——AI 不是在『回憶事實』，是在『猜下一個最可能的字』」</li>
<li>教材參考：南大生成式AI教材【腳本】06. 生成式AI：一種會接龍的函數</li>
</ul>
</div>
</div>
<div id="outline-container-org141698c" class="outline-3">
<h3 id="org141698c"><span class="section-number-3">8.3.</span> Token：AI 眼中的世界</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>「為什麼 AI 有時候數學會算錯？因為它看到的不是數字，是這個——」</li>
<li>用 Tokenizer 展示「虎尾糖廠」被切成什麼 token（中文斷詞特別有趣）</li>
<li>再試「314159」——數字的 token 切法跟你想的完全不一樣</li>
</ul>
</div>
</div>
<div id="outline-container-orge8e9d6c" class="outline-3">
<h3 id="orge8e9d6c"><span class="section-number-3">8.4.</span> 訓練三階段</h3>
<div class="outline-text-3" id="text-8-4">
<ol class="org-ol">
<li>*預訓練*：讀了整個網路 → 學會語言模式</li>
<li>*微調（Fine-tuning）*：針對特定任務練習 → 學會當助理</li>
<li>*RLHF*：人類告訴它什麼是好答案 → 學會避免有害回應</li>
</ol>
</div>
</div>
<div id="outline-container-orgae424ec" class="outline-3">
<h3 id="orgae424ec"><span class="section-number-3">8.5.</span> 幻覺（Hallucination）——回到主線的警鐘</h3>
<div class="outline-text-3" id="text-8-5">
<p>
用今天的主題來抓包：
</p>
<ul class="org-ul">
<li>Demo：「請描述 1920 年雲林農民組合抗議虎尾糖廠壓低甘蔗收購價格的經過」</li>
<li>看 AI 掰出什麼：人名、日期、事件經過講得頭頭是道，但可能整段都是編的</li>
<li>跟第一段 NotebookLM 的資料交叉比對——哪些是真的、哪些是幻覺？</li>
<li>用 AI 出台灣史練習題，常見「四個選項都對」「答案對不上」「題幹自相矛盾」</li>
<li>結論：AI 不是知識庫，是語言模型</li>
<li>*給學習歷程的警告*：大學教授一年看幾千份，你掰的他看得出來</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd01ea9" class="outline-3">
<h3 id="orgfd01ea9"><span class="section-number-3">8.6.</span> 另一條紅線：什麼東西不該丟雲端</h3>
<div class="outline-text-3" id="text-8-6">
<p>
AI 很強，但你打進去的每一個字，理論上都會離開你的電腦。
</p>
<ul class="org-ul">
<li>哪些東西要小心？
<ul class="org-ul">
<li>日記、心情筆記、感情問題、家裡狀況</li>
<li>班上同學的個資、輔導紀錄、申訴內容</li>
<li>還沒公開的競賽作品、原創小說、專題點子</li>
</ul></li>
<li>進階解法（點到為止）：本機 AI（例：ollama + 開源模型）
<ul class="org-ul">
<li>跑在你自己的筆電上，資料完全不外流</li>
<li>效能比雲端弱，但夠用來改作文、整理日記</li>
</ul></li>
<li>一個判準：「這段話如果被截圖貼到網路上，我會崩潰嗎？」會 → 別丟雲端</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org26e16c3" class="outline-2">
<h2 id="org26e16c3"><span class="section-number-2">9.</span> 收尾（5 min）</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org0051120" class="outline-3">
<h3 id="org0051120"><span class="section-number-3">9.1.</span> 你手上現在有什麼？</h3>
<div class="outline-text-3" id="text-9-1">
<p>
把今天做的東西攤開——全部圍繞同一個主題：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">階段</th>
<th scope="col" class="org-left">成品</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">讀</td>
<td class="org-left">NotebookLM 研究筆記 + 選題方向</td>
</tr>

<tr>
<td class="org-left">做</td>
<td class="org-left">Napkin 因果關係圖 + Claude 小論文 Word 初稿</td>
</tr>

<tr>
<td class="org-left">學</td>
<td class="org-left">跟 AI 來回三輪改出來的反思，貼回 Word 完成定稿</td>
</tr>

<tr>
<td class="org-left">簡報</td>
<td class="org-left">Gamma 或 Claude 生成的報告簡報</td>
</tr>

<tr>
<td class="org-left">創造</td>
<td class="org-left">一個互動時間軸網頁 + 一張 Ideogram 封面圖（加分）</td>
</tr>
</tbody>
</table>

<p>
三小時前你還在煩惱學習歷程怎麼寫，現在你手上有一份 Word + 一份簡報 + 一個互動網頁。
</p>
</div>
</div>
<div id="outline-container-org903e7f7" class="outline-3">
<h3 id="org903e7f7"><span class="section-number-3">9.2.</span> 三個帶走的觀念</h3>
<div class="outline-text-3" id="text-9-2">
<ol class="org-ol">
<li><b>AI 讓你的產出品質升級，不是代寫</b> ——你做過的事，AI 幫你加速表達</li>
<li><b>從使用者升級成駕馭者</b> ——學會整合 AI 進你的工作流</li>
<li><b>審查委員要看的不是 AI，是你</b> ——你的判斷力就是你的價值</li>
</ol>
</div>
</div>
<div id="outline-container-org7094b5f" class="outline-3">
<h3 id="org7094b5f"><span class="section-number-3">9.3.</span> 下一步：往 Lv.4 走</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>今天教的是 Lv.1→Lv.3：你下指令，AI 動手</li>
<li>Lv.4 正在發生（2026 起）：AI 記得你的偏好、你的寫作風格、你常用的格式</li>
<li>例如：訓練一個「我的學習歷程助理」，它知道你哪些科目、什麼風格、上一份報告做到哪</li>
<li>*本場不展開*，但你要知道——今天學的不是「終點」，是「起點」</li>
<li>回家作業（給有興趣的人）：去看一下 Anthropic Skills、ChatGPT Custom GPT，挑一個試試看</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org538845f" class="outline-2">
<h2 id="org538845f"><span class="section-number-2">10.</span> 附錄：工具準備清單</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">工具</th>
<th scope="col" class="org-left">費用</th>
<th scope="col" class="org-left">事前準備</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">NotebookLM</td>
<td class="org-left">免費（Google 帳號）</td>
<td class="org-left">預先上傳三份糖業史料 PDF</td>
</tr>

<tr>
<td class="org-left">Gamma</td>
<td class="org-left">免費版夠用</td>
<td class="org-left">建好帳號</td>
</tr>

<tr>
<td class="org-left">Napkin</td>
<td class="org-left">免費</td>
<td class="org-left">準備一段產業流程文字</td>
</tr>

<tr>
<td class="org-left">Claude（網頁版）</td>
<td class="org-left">免費（每5hr 15-40則）</td>
<td class="org-left">建好帳號，用來組裝 Word 檔</td>
</tr>

<tr>
<td class="org-left">ChatGPT 語音</td>
<td class="org-left">免費版可用</td>
<td class="org-left">手機裝好 app</td>
</tr>

<tr>
<td class="org-left">Claude Code</td>
<td class="org-left">需訂閱或 API</td>
<td class="org-left">預先裝好，準備 Demo 腳本</td>
</tr>

<tr>
<td class="org-left">Gemini CLI</td>
<td class="org-left">免費（用 API Key）</td>
<td class="org-left">到 AI Studio 先拿 key</td>
</tr>

<tr>
<td class="org-left">Ideogram</td>
<td class="org-left">免費版有額度</td>
<td class="org-left">建好帳號</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org392557d" class="outline-2">
<h2 id="org392557d"><span class="section-number-2">11.</span> 附錄：NotebookLM 素材——請把以下連結存成 PDF 後上傳</h2>
<div class="outline-text-2" id="text-11">
<p>
操作方式：點開連結 → 在瀏覽器按 <code>Ctrl+P</code> （Mac 按 <code>⌘+P</code> ）→ 目的地選「儲存為 PDF」→ 上傳到 NotebookLM。
</p>
</div>
<div id="outline-container-org66f90c0" class="outline-3">
<h3 id="org66f90c0"><span class="section-number-3">11.1.</span> 主要素材（建議三份都上傳）</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-org0a98223" class="outline-4">
<h4 id="org0a98223"><span class="section-number-4">11.1.1.</span> 1. 臺灣糖業史——維基百科</h4>
<div class="outline-text-4" id="text-11-1-1">
<ul class="org-ul">
<li><a href="https://zh.wikipedia.org/zh-tw/%E8%87%BA%E7%81%A3%E7%B3%96%E6%A5%AD%E5%8F%B2">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>性質：從荷蘭時期到戰後的完整通史，結構清楚，有時間軸</li>
<li>重點段落：日治時期新式製糖工場的建立、四大製糖會社、原料採取區域制度</li>
</ul>
</div>
</div>
<div id="outline-container-orgd195cc5" class="outline-4">
<h4 id="orgd195cc5"><span class="section-number-4">11.1.2.</span> 2. 臺灣「糖都」之父——虎尾糖廠</h4>
<div class="outline-text-4" id="text-11-1-2">
<ul class="org-ul">
<li><a href="https://vocus.cc/article/6667e00efd89780001a6eb91">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>性質：在地故事，故事性強，讀起來不像課本</li>
<li>重點：鈴木藤三郎（「製糖王」）、1897 戊戌大水災催生糖廠、「東洋第一」的由來</li>
</ul>
</div>
</div>
<div id="outline-container-orga679c70" class="outline-4">
<h4 id="orga679c70"><span class="section-number-4">11.1.3.</span> 3. 虎尾糖廠製糖工場——台糖官網</h4>
<div class="outline-text-4" id="text-11-1-3">
<ul class="org-ul">
<li><a href="https://www.taisugar.com.tw/chinese/Attractions_detail.aspx?n=10048&amp;s=69&amp;p=0">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>性質：官方資料，簡短但有權威性</li>
<li>重點：1907 年建廠沿革、目前全台唯二仍在製糖、轄區面積與年蔗量</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0f10858" class="outline-3">
<h3 id="org0f10858"><span class="section-number-3">11.2.</span> 補充素材（進階探索用）</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-orgfb2e8bd" class="outline-4">
<h4 id="orgfb2e8bd"><span class="section-number-4">11.2.1.</span> 4. 近代產業——雲林糖業的興衰（楊彥騏）</h4>
<div class="outline-text-4" id="text-11-2-1">
<ul class="org-ul">
<li><a href="https://www.twcenter.org.tw/wp-content/uploads/2015/05/g02_07_02_05.pdf">點此下載 PDF</a></li>
<li>來源：台灣學智庫／楊彥騏（雲林在地文史工作者、協志高中教師）</li>
<li>性質：完整涵蓋雲林四座糖廠（虎尾、斗六、北港、龍巖）的興衰史，含創廠人物、產業貢獻、戰後轉型</li>
<li>重點：虎尾糖廠總廠的詳細沿革、鈴木藤三郎與藤山雷太、「東洋第一」酒精工場、四座糖廠的不同性格比較</li>
<li>適合：最貼近工作坊主題的一篇，在地視角 + 完整脈絡</li>
</ul>
</div>
</div>
<div id="outline-container-orgd759f2d" class="outline-4">
<h4 id="orgd759f2d"><span class="section-number-4">11.2.2.</span> 5. 甜蜜蜜的時空之旅——認識臺灣糖業故事</h4>
<div class="outline-text-4" id="text-11-2-2">
<ul class="org-ul">
<li><a href="https://the.nmth.gov.tw/Uploads/Resource/Files/98d11ec4-cec9-42b0-9bcc-a3d281ceab7b.pdf">點此下載 PDF</a></li>
<li>來源：國立臺灣歷史博物館</li>
<li>性質：教學資源 PDF，7 頁，圖文並茂</li>
</ul>
</div>
</div>
<div id="outline-container-org31ce1fa" class="outline-4">
<h4 id="org31ce1fa"><span class="section-number-4">11.2.3.</span> 6. 探訪糖與蜜之地——雲林虎尾百年糖廠</h4>
<div class="outline-text-4" id="text-11-2-3">
<ul class="org-ul">
<li><a href="https://smiletaiwan.cw.com.tw/article/4141">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：微笑台灣（天下雜誌）</li>
<li>性質：圖文報導，有現場照片，適合當視覺參考</li>
</ul>
</div>
</div>
<div id="outline-container-org92ad889" class="outline-4">
<h4 id="org92ad889"><span class="section-number-4">11.2.4.</span> 7. 產業與城市共生時——從糖業的興衰看糖鄉虎尾的潛力</h4>
<div class="outline-text-4" id="text-11-2-4">
<ul class="org-ul">
<li><a href="https://digitalarchives.tw/Exhibition/2424/1.html">點此開啟</a></li>
<li>來源：數位典藏與數位學習國家型科技計畫（虎尾科大「再現糖業風華」計畫）</li>
<li>性質：有 13 本免費電子書，涵蓋老照片、建物履歷、製糖流程</li>
</ul>
</div>
</div>
