forTeacher.html
<div id="outline-container-org460afe5" class="outline-4">
<h4 id="org460afe5"><span class="section-number-4">11.2.5.</span> 8. 文化資料開放服務網——糖業的過去與現在</h4>
<div class="outline-text-4" id="text-11-2-5">
<ul class="org-ul">
<li><a href="https://opendata.culture.tw/frontsite/sugar">點此開啟</a></li>
<li>來源：文化部</li>
<li>性質：整合文資局古蹟、歷史建築等開放資料，含虎尾糖廠鐵橋等</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4277ea" class="outline-4">
<h4 id="orgd4277ea"><span class="section-number-4">11.2.6.</span> 9. 台糖通訊——臺灣糖業小史（1620-1901）</h4>
<div class="outline-text-4" id="text-11-2-6">
<ul class="org-ul">
<li><a href="https://www.taisugar.com.tw/monthly/CPN.aspx?ms=1495&amp;p=13389178&amp;s=13389186">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：台糖公司內部刊物</li>
<li>性質：新式糖業誕生前的歷史脈絡，從荷蘭到清末</li>
</ul>
</div>
</div>
<div id="outline-container-org417df79" class="outline-4">
<h4 id="org417df79"><span class="section-number-4">11.2.7.</span> 10. 虎糖與糖都所交織的特殊風情——台糖通訊</h4>
<div class="outline-text-4" id="text-11-2-7">
<ul class="org-ul">
<li><a href="https://www.taisugar.com.tw/monthly/CPN.aspx?ms=1485&amp;p=13388859&amp;s=13388881">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：台糖通訊 2022 年 8 月號</li>
<li>性質：介紹虎尾糖廠與糖都的文化風情，生活風格類專題</li>
</ul>
</div>
</div>
<div id="outline-container-orgab56e4c" class="outline-4">
<h4 id="orgab56e4c"><span class="section-number-4">11.2.8.</span> 11. 虎尾糖廠——國家文化記憶庫線上策展</h4>
<div class="outline-text-4" id="text-11-2-8">
<ul class="org-ul">
<li><a href="https://curation.culture.tw/curation/public?id=1702">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：國家文化記憶庫（時空旅行社策展平臺）</li>
<li>性質：以虎尾糖廠為案例的線上展覽，涵蓋「工業日本、農業臺灣」政策、新式機械製糖技術、糖廠轉型文創</li>
<li>適合：圖文豐富，直接丟進 NotebookLM 效果好</li>
</ul>
</div>
</div>
<div id="outline-container-orge9981f8" class="outline-4">
<h4 id="orge9981f8"><span class="section-number-4">11.2.9.</span> 12. 台灣蔗糖的晚年記事——糖廠轉型困境（公視《我們的島》）</h4>
<div class="outline-text-4" id="text-11-2-9">
<ul class="org-ul">
<li><a href="https://ourisland.pts.org.tw/content/1084">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：公共電視《我們的島》第 495 集（2009）</li>
<li>性質：報導糖業衰退與轉型困境，虎尾糖廠為重點對象</li>
<li>重點：虎尾五分車是全台僅剩還在載運甘蔗的列車、日式宿舍遭拆除的文資爭議</li>
<li>適合：從「產業轉型」或「文化資產保存」角度切入學習歷程的同學</li>
</ul>
</div>
</div>
<div id="outline-container-org655003b" class="outline-4">
<h4 id="org655003b"><span class="section-number-4">11.2.10.</span> 13. 說糖 HUWEI SUGAR——虎尾糖業文化路徑</h4>
<div class="outline-text-4" id="text-11-2-10">
<ul class="org-ul">
<li><a href="https://www.huweisugar.com/Course/Detail/3fba5042-a243-45f0-af61-1e6cb9f38ff4">點此開啟</a>（瀏覽器列印存 PDF）</li>
<li>來源：雲林虎尾說糖官方網站（雲林記憶 Cool）</li>
<li>性質：在地糖業文化體驗課程介紹、實境解謎活動，結合教育與觀光</li>
<li>適合：展示虎尾糖廠「現在進行式」的活化案例，補充歷史素材之外的當代觀點</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org1e09faf" class="outline-2">
<h2 id="org1e09faf"><span class="section-number-2">12.</span> 附錄：小論文格式規範（貼給 Claude 用）</h2>
<div class="outline-text-2" id="text-12">
<p>
以下是「全國高級中等學校小論文寫作比賽格式說明」的完整規範。使用時請整段複製，連同你的素材一起貼進 Claude 或 Gemini 的對話框。
</p>

<p>
格式說明 PDF 原始來源：<a href="https://www.cdjh.hc.edu.tw/uploads/1589183819709PERVPvtb.pdf">點此下載 PDF</a>
</p>

<pre class="example" id="org758be60">
【全國高級中等學校小論文寫作比賽格式說明】

壹、篇幅要求
小論文篇幅以 A4 紙張 4-10 頁為限（不含封面）。
【未按照此規定之作品，只給 1 分】

貳、版面要求
一、使用新細明體 12 級字打字，不可放大字型，單行間距，邊界上下左右各留 2 公分。
二、版面編排
  （一）所有標題皆須單獨成行。
  （二）標題與段落之間要空一行。
  （三）段落與段落之間要空一行。
  （四）段落開頭與一般中英文寫作相同。
三、頁首及首尾：每頁頁首需加入小論文篇名，頁尾插入頁碼。文字為 10 級字、置中。
【未按照此規定之作品，總分扣 1 分】

參、格式說明
小論文之基本架構分為「封面頁」及四大段落：「壹、前言」、「貳、正文」、「參、結論」、「肆、引註資料」
（英文寫作類請用：I. Introduction II. Body III. Conclusion IV. References）

一、封面頁
  （一）單獨一頁、不編頁碼。
  （二）含投稿類別、小論文篇名、作者及指導老師。
  （三）不能有插圖。
  （四）作者依「姓名。學校。部別/年級」之順序編排。

二、前言
  此處可以就為何選擇這個題目，透過什麼方法、運用什麼概念進行資料搜集，整篇文章的討論架構與範圍，以及想要達成的目的摘要而寫。

三、正文
  （一）「正文」為小論文之主體所在。
  （二）在形式上必須分層次、分段來條列說明。「正文」之論述層次可參考下例：
    一、○○○○
      （一）○○○○
        1、○○○○
          （1）○○○○
  ※小論文因規模較小，建議分成四個層次即可。
  （三）在內容上應特別強調相關資料的引用、彙整、分析、辯證，亦即需「引經據典」地進行文獻探討。
  （四）文中引用別人資料時需加註資料來源，若直接引用原文，請以粗體並加「」標明，引用結束需標明（作者，年代），並於「肆、引註資料」段說明資料來源。
  ※注意：同一處引用參考資料（單一書籍、期刊、報紙...）之原文不得超過 50 字，詩文、劇本、法律條文等不在此限。
  （五）正文中如有引用圖/表，圖/表需有編號及標題。圖之編號/標題在下，表之編號/標題在上，圖/表下面需註明資料來源。
  ※圖之大小不得超過頁面 1/4，表不在此限。

四、結論
  （一）「結論」主要包括研究過程中所遇到的種種現象思考、或根據研究結果提出看法，以及提出未來值得進一步研究的方向。
  （二）「結論」亦可用條列方式陳述，使讀者清楚明瞭。

五、引註資料
  （一）每篇小論文皆需附引註資料。
  （二）引註資料亦可方便讀者依線索尋找原資料閱讀，故需註明清楚。
  （三）小論文比賽參考資料至少要 3 篇，並不得全部來自網站。
  【未按照此規定之作品，只給 1 分】

六、引註格式
  正文引用及引註資料書寫範例請參閱中學生網站「全國高級中等學校小論文寫作比賽引註資料格式範例」。
  【引用格式錯誤，總分扣 1 分】
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-04-30</p>
<p class="author">Author: 臺南一中 顏永進</p>
<p class="date">Created: 2026-04-28 Tue 12:54</p>
</div>
</body>
</html>
